# Задание 2: Сумма двух чисел
# Описание: Напишите функцию, которая принимает два числа и возвращает их сумму.
# Вход: Два числа (например, 5 и 3)
# Выход: Число — результат сложения.

def sum(a, b):
    return a + b

resul = sum(5, 3)
print(resul)

resul = sum(5, 7)
print(resul)